Revit 2024 API
BuiltInFailures.FloorFailures Class
 Failures related to floors and slabs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class FloorFailures
Visual Basic
Public NotInheritable Class FloorFailures
Visual C++
public ref class FloorFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FloorFailures
See Also
BuiltInFailures.FloorFailures Members
Autodesk.Revit.DB Namespace